Config/Reports/НастройкаПравДоступаКТиповымОперациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>НастройкаПравДоступаКТиповымОперациям</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Reports/НастройкаПравДоступаКТиповымОперациям/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Пользователь = Справочники.Пользователи.ПустаяСсылка();
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Использование = Ложь;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Использование = Ложь;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Использование = Ложь;
	
	ИдентификаторТипаДокументы = ОбщегоНазначенияБГУПовтИсп.СсылкаИдентификатораОбъектаМетаданных("Документы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Источник = УникальныйИдентификатор И ИмяСобытия = "ВыборОбъектовМетаданных" Тогда
		Если Параметр.Количество()>0 Тогда
			Отчет.Документ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Параметр[0].Значение, ".")[1];
			Элементы.Документ.СписокВыбора.Очистить();
			Элементы.Документ.СписокВыбора.Добавить(Отчет.Документ, Параметр[0].Представление);
			Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].ПравоеЗначение = Отчет.Документ; 
			Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Использование = Истина; 
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)
	Настройки.Элементы[0].Использование = Ложь; 
	Настройки.Элементы[1].Использование = Ложь; 
	Настройки.Элементы[2].Использование = Ложь; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].ПравоеЗначение = Отчет.Документ; 
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Использование = ЗначениеЗаполнено(Отчет.Документ); 
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Использование = ЗначениеЗаполнено(Отчет.ТиповаяОперация); 
КонецПроцедуры

&НаКлиенте
Процедура ТиповаяОперацияПриИзменении(Элемент)
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].ПравоеЗначение = Отчет.ТиповаяОперация; 
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Использование = ЗначениеЗаполнено(Отчет.ТиповаяОперация); 
КонецПроцедуры

&НаКлиенте
Процедура ДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.ОткрытьФормуВыбораИдентификатораОбъектаМетаданных(
		Элемент, ДанныеВыбора, СтандартнаяОбработка,
		Новый Структура("ТекущаяСтрока", Отчет.Документ), 
		ИдентификаторТипаДокументы, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].ПравоеЗначение = Отчет.Пользователь; 
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Использование = ЗначениеЗаполнено(Отчет.Пользователь); 
КонецПроцедуры

 &НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	ПолучитьДанныеРасшифровки(Расшифровка, СтандартнаяОбработка);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьДанныеРасшифровки(Расшифровка, СтандартнаяОбработка)

	РасшифровкаОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ТекущаяЯчейка = Элементы.Результат.ПолучитьВыделенныеОбласти()[0];
	
	ТекущееЗначение = "";
	ТекущееПоле = "";
	Если ТипЗнч(ТекущаяЯчейка.Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		ПоляРасшифровки = РасшифровкаОтчета.Элементы.Получить(ТекущаяЯчейка.Расшифровка).ПолучитьПоля();
		Если ПоляРасшифровки.Количество()>0 Тогда
			ТекущееЗначение = ?(ТекущаяЯчейка.Текст="V", Истина, Ложь);
			ТекущееПоле = ПоляРасшифровки[0].Поле;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущееПоле = "ПраваНеЗаданы" ИЛИ ТекущееПоле = "Документ" Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если ТекущееПоле <> "ПравоЧтения" И ТекущееПоле <> "ПравоИзменения" Тогда
		Возврат;
	КонецЕсли;
	
	
	Верх = ТекущаяЯчейка.Верх;
	Лево = ТекущаяЯчейка.Лево;
	ЯчейкаОперации = Результат.Область("R"+Верх+"C1");
	Если Результат.Область("R2C"+Лево).Текст = "Исп." Тогда
		ЯчейкаПользователя = Результат.Область("R1C"+Лево);
	ИначеЕсли Результат.Область("R2C"+Лево).Текст = "Настр." Тогда
		ЯчейкаПользователя = Результат.Область("R1C"+(Лево-1));
	Иначе
		Возврат;
	КонецЕсли;
	
	Пользователь = "";
	Операция = "";
	ТекущееЗначение = "";
	ТекущееПоле = "";
	Если ТипЗнч(ТекущаяЯчейка.Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		ПоляРасшифровки = РасшифровкаОтчета.Элементы.Получить(ТекущаяЯчейка.Расшифровка).ПолучитьПоля();
		Если ПоляРасшифровки.Количество()>0 Тогда
			ТекущееЗначение = ?(ТекущаяЯчейка.Текст="V", Истина, Ложь);
			ТекущееПоле = ПоляРасшифровки[0].Поле;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ЯчейкаПользователя.Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		ПоляРасшифровки = РасшифровкаОтчета.Элементы.Получить(ЯчейкаПользователя.Расшифровка).ПолучитьПоля();
		Если ПоляРасшифровки.Количество()>0 Тогда
			Пользователь = ПоляРасшифровки[0].Значение;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(ЯчейкаОперации.Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		ПоляРасшифровки = РасшифровкаОтчета.Элементы.Получить(ЯчейкаОперации.Расшифровка).ПолучитьПоля();
		Если ПоляРасшифровки.Количество()>0 Тогда
			Операция = ПоляРасшифровки[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Операция) И ЗначениеЗаполнено(Пользователь) Тогда
		СтандартнаяОбработка = Ложь;
		
		// проверим права текущего пользователя на изменение прав к операции
		Если Операция.РазрешенныеПользователи.Количество()>0 Тогда
			НетПрав = Истина;
			СтрТекПользователь = Операция.РазрешенныеПользователи.Найти(Пользователи.АвторизованныйПользователь(), "Пользователь");
			Если СтрТекПользователь <> Неопределено Тогда
				НетПрав = НЕ СтрТекПользователь.ПравоИзменения;
			КонецЕсли;
			Если НетПрав Тогда
				Если Операция.РазрешенныеПользователи.Найти(Истина, "ПравоИзменения")<>Неопределено Тогда
					
					ТекстСообщения = НСтр("ru='Отстуствуют права на редактирование выбранной операции.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ОперацияОбъект = Операция.ПолучитьОбъект();
		Попытка
		
			ОперацияОбъект.Заблокировать()
		
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось заблокировать типовую операцию ""%1"". Возможно она редактируется другим пользователем.
									|Необходимо закрыть типовую операцию и повторить операцию.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Операция);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Операция);
			Возврат;
		
		КонецПопытки;
		
		Если ТекущееПоле = "ПравоЧтения" Тогда
			Если ТекущееЗначение = Истина Тогда
				СтрПользователь = ОперацияОбъект.РазрешенныеПользователи.Найти(Пользователь, "Пользователь");
				Если СтрПользователь<>Неопределено Тогда
					ОперацияОбъект.РазрешенныеПользователи.Удалить(СтрПользователь);
				КонецЕсли;
			Иначе
				СтрПользователь = ОперацияОбъект.РазрешенныеПользователи.Найти(Пользователь, "Пользователь");
				Если СтрПользователь=Неопределено Тогда
					СтрПользователь = ОперацияОбъект.РазрешенныеПользователи.Добавить();
					СтрПользователь.Пользователь = Пользователь;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ТекущееЗначение = Истина Тогда 
				СтрПользователь = ОперацияОбъект.РазрешенныеПользователи.Найти(Пользователь, "Пользователь");
				Если СтрПользователь<>Неопределено Тогда
					СтрПользователь.ПравоИзменения = Ложь;
				КонецЕсли;
			Иначе
				СтрПользователь = ОперацияОбъект.РазрешенныеПользователи.Найти(Пользователь, "Пользователь");
				Если СтрПользователь<>Неопределено Тогда
					СтрПользователь.ПравоИзменения = Истина;
				Иначе
					СтрПользователь = ОперацияОбъект.РазрешенныеПользователи.Добавить();
					СтрПользователь.Пользователь = Пользователь;
					СтрПользователь.ПравоИзменения = Истина;
				КонецЕсли;
			КонецЕсли;				
		КонецЕсли;
		ОперацияОбъект.Записать();
		
	КонецЕсли;

	СкомпоноватьРезультат();
КонецПроцедуры // ПолучитьДанныеРасшифровки()

#КонецОбласти
